### pandas use cases
1.data transformation

2.data analysis

3.data cleaning

### pandas notations:

1.series-----creating the data

2.dataframe---for making the data in particular tabular format

In [1]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':20,'s3':30}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    20
s3    30
dtype: int64

In [3]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final

    Internal1  Internal2
s1         20         10
s2         10         20
s3         30         30

In [5]:
final.columns

Index(['Internal1', 'Internal2'], dtype='object')

In [6]:
final.values

array([[20, 10],
       [10, 20],
       [30, 30]], dtype=int64)

In [9]:
for i in final.values: 
     print (i[0],i[1])

20 10
10 20
30 30

In [10]:
for i in final.values: 
     print (i[0])

20
10
30

In [11]:
final.loc['s4']=[20,30]

In [12]:
final

    Internal1  Internal2
s1         20         10
s2         10         20
s3         30         30
s4         20         30

In [15]:
final.drop("s4")

    Internal1  Internal2
s1         20         10
s2         10         20
s3         30         30

In [16]:
final.values[2]=[12,30]

In [17]:
final

    Internal1  Internal2
s1         20         10
s2         10         20
s3         12         30
s4         20         30

In [20]:
### reading the csv files using pandas
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,3795,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [22]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [ ]:
sum=0
for i in range(2,11):
    sum+=income.values[2][i]